public class BinaryTest092{
    public static void main(String[] args){


        int a = 0b1010;
        //0b開頭為二進制
        int b = 1010;
        //10 進制
        int c = 01010;
        //0開頭為8進制
        int d = 0x10101;
        //0x開頭為16進制

        System.out.println(a);
        System.out.println(b);
        System.out.println(c);
        System.out.println(d);

        /*2 to 8 :把2拆成三個一組
        0b11010101
        011(3) 010(2) 101(5)
        = 325
        */

       /*2 to 16 : 拆成4個一組
       0b11010101
       1101(13->D) 0101(5)
       = 0xD5
        */

       /*8 to 2
       把每一位數轉成對應的3位的2進制
       0237
       02(010) 3(011) 7(111)
       =0b010011111
        */

       /*16 to 2
       把每一位數轉成對應的4位的2進制
       0x23b
       2(0010)  3(0011) B(11->10 11)
       = 0b001000111111
        */

       /* 原碼、反碼、補碼(重要)
       1.二進制最高位是符號位：0->正、1->負
       2.正數的原碼、反碼、補碼都是一樣的
       3.負數反碼=符號位不變，其他位數取反
       4.負數補碼=反碼+1(反之 負數反碼=補碼-1)
       5."0"的反碼補碼都是"0"
       6.java的數都是有符號位的
       7.計算機運行計算時，都是以補碼進行運算的
       8.要看運算結果的話，都是看原碼來看結果
        */
    }
}