public class OperatorPriority080{
    public static void main (String[] args){
        //(一)運算符優先順序
        /*
        1.()  {}  ;  .  ,
        2.單目運算 ++ --
        3.算術運算 + - * / %
        4.位移運算 >> >>> <<
        5.比較運算 <  >  <=  >=  ==  !=
        6.邏輯運算 & && | || ^  !
        7.三元運算 _______?_1_:_2_
        8.賦值運算 = *= += /= -= %=
        */

       //(二)標示符(自己命名的變量代號名稱)
        /*◎規則
        1.由26個英文字母,0-9,_或$組成
        2.不可以數字開頭命名
        3.不可使用關鍵字或保留字，但可包含關鍵字
        4.命名規則嚴格區分大小寫，但長度沒有限制
        5.不可以有空格
        
         ◎規範
         1.包名，都小寫aaa.bbb.ccc
         2.類名、街口名，第一個字母大寫AaaBbbCcc(大駝峰)
         3.變量名，第一個單字小寫，後面單字首字母大寫 aaaBbbCcc(小駝峰)
         4.常量名，所有字母大寫，多單字以_隔開。TAX_RATE(稅率)
         */
    }
}